; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph2 - mode
	infrared3 - mode
	image0 - mode
	image1 - mode
	spectrograph4 - mode
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star8 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	GroundStation5 - direction
	Star4 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image0)
	(supports instrument0 image1)
	(supports instrument0 spectrograph4)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
)
(:goal (and
	(have_image Planet9 thermograph2)
	(have_image Phenomenon10 infrared3)
	(have_image Planet11 image0)
	(have_image Planet12 infrared3)
	(have_image Phenomenon13 image0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 planet11 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet11)
   goals met: 0 of 5
4. (take_image satellite0 planet11 instrument0 image0)
   added: (have_image planet11 image0)
   goals met: 1 of 5
5. (turn_to satellite0 phenomenon13 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 5
6. (take_image satellite0 phenomenon13 instrument0 image0)
   added: (have_image phenomenon13 image0)
   goals met: 2 of 5
7. (turn_to satellite0 phenomenon10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 5
8. (take_image satellite0 phenomenon10 instrument0 infrared3)
   added: (have_image phenomenon10 infrared3)
   goals met: 3 of 5
9. (turn_to satellite0 planet12 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet12)
   goals met: 3 of 5
10. (take_image satellite0 planet12 instrument0 infrared3)
   added: (have_image planet12 infrared3)
   goals met: 4 of 5
11. (turn_to satellite0 planet9 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet9)
   goals met: 4 of 5
12. (take_image satellite0 planet9 instrument0 thermograph2)
   added: (have_image planet9 thermograph2)
   goals met: 5 of 5
